{"object_name_to_idx": {"__image__": 0, "person": 1, "tree": 2, "window": 3, "wall": 4, "shirt": 5, "building": 6, "ground": 7, "sky": 8, "sign": 9, "grass": 10, "pole": 11, "leg": 12, "head": 13, "cloud": 14, "table": 15, "light": 16, "hand": 17, "car": 18, "hair": 19, "leaf": 20, "water": 21, "line": 22, "door": 23, "shoe": 24, "pant": 25, "fence": 26, "plate": 27, "chair": 28, "floor": 29, "glass": 30, "road": 31, "wheel": 32, "street": 33, "jacket": 34, "arm": 35, "flower": 36, "sidewalk": 37, "hat": 38, "stripe": 39, "tail": 40, "snow": 41, "boy": 42, "handle": 43, "field": 44, "rock": 45, "letter": 46, "face": 47, "eye": 48, "girl": 49, "foot": 50, "bag": 51, "short": 52, "tile": 53, "bush": 54, "post": 55, "track": 56, "helmet": 57, "plant": 58, "tire": 59, "picture": 60, "bottle": 61, "roof": 62, "boat": 63, "food": 64, "umbrella": 65, "train": 66, "branch": 67, "wave": 68, "player": 69, "bench": 70, "box": 71, "shelf": 72, "pillow": 73, "top": 74, "dirt": 75, "trunk": 76, "bowl": 77, "house": 78, "horse": 79, "logo": 80, "bus": 81, "clock": 82, "mountain": 83, "bike": 84, "board": 85, "giraffe": 86, "number": 87, "bird": 88, "plane": 89, "paper": 90, "mirror": 91, "elephant": 92, "dog": 93, "truck": 94, "cup": 95, "cow": 96, "cap": 97, "brick": 98, "writing": 99, "counter": 100, "motorcycle": 101, "spot": 102, "hill": 103, "zebra": 104, "banana": 105, "lamp": 106, "cabinet": 107, "book": 108, "child": 109, "surfboard": 110, "sheep": 111, "sand": 112, "animal": 113, "kite": 114, "skateboard": 115, "cat": 116, "beach": 117, "container": 118, "flag": 119, "lady": 120, "bear": 121, "sink": 122, "pizza": 123, "bed": 124, "towel": 125, "ocean": 126, "guy": 127, "laptop": 128, "desk": 129, "tower": 130, "vase": 131, "pot": 132, "airplane": 133, "toilet": 134, "skier": 135, "kid": 136, "orange": 137, "fork": 138, "knife": 139, "bicycle": 140, "cake": 141, "apple": 142, "donut": 143, "computer": 144, "surfer": 145, "sandwich": 146, "skateboarder": 147, "catcher": 148}, "object_idx_to_name": ["__image__", "person", "tree", "window", "wall", "shirt", "building", "ground", "sky", "sign", "grass", "pole", "leg", "head", "cloud", "table", "light", "hand", "car", "hair", "leaf", "water", "line", "door", "shoe", "pant", "fence", "plate", "chair", "floor", "glass", "road", "wheel", "street", "jacket", "arm", "flower", "sidewalk", "hat", "stripe", "tail", "snow", "boy", "handle", "field", "rock", "letter", "face", "eye", "girl", "foot", "bag", "short", "tile", "bush", "post", "track", "helmet", "plant", "tire", "picture", "bottle", "roof", "boat", "food", "umbrella", "train", "branch", "wave", "player", "bench", "box", "shelf", "pillow", "top", "dirt", "trunk", "bowl", "house", "horse", "logo", "bus", "clock", "mountain", "bike", "board", "giraffe", "number", "bird", "plane", "paper", "mirror", "elephant", "dog", "truck", "cup", "cow", "cap", "brick", "writing", "counter", "motorcycle", "spot", "hill", "zebra", "banana", "lamp", "cabinet", "book", "child", "surfboard", "sheep", "sand", "animal", "kite", "skateboard", "cat", "beach", "container", "flag", "lady", "bear", "sink", "pizza", "bed", "towel", "ocean", "guy", "laptop", "desk", "tower", "vase", "pot", "airplane", "toilet", "skier", "kid", "orange", "fork", "knife", "bicycle", "cake", "apple", "donut", "computer", "surfer", "sandwich", "skateboarder", "catcher"], "attribute_name_to_idx": {"white": 0, "black": 1, "green": 2, "blue": 3, "red": 4, "brown": 5, "yellow": 6, "small": 7, "large": 8, "wooden": 9, "gray": 10, "silver": 11, "metal": 12, "orange": 13, "grey": 14, "tall": 15, "long": 16, "dark": 17, "pink": 18, "standing": 19, "clear": 20, "white ": 21, "round": 22, "tan": 23, "here": 24, "wood": 25, "glass": 26, "open": 27, "purple": 28, "big": 29, "short": 30, "plastic": 31, "parked": 32, "sitting": 33, "walking": 34, "black ": 35, "striped": 36, "young": 37, "brick": 38, "gold": 39, "empty": 40, "hanging": 41, "old": 42, "on": 43, "blue ": 44, "bright": 45, "concrete": 46, "cloudy": 47, "green ": 48, "colorful": 49, "one": 50, "beige": 51, "bare": 52, "wet": 53, "closed": 54, "square": 55, "light": 56, "stone": 57, "little": 58, "blonde": 59, "shiny": 60, "red ": 61, "dirty": 62, "thin": 63, "smiling": 64, "painted": 65, "flying": 66, "brown ": 67, "thick": 68, "sliced": 69, "playing": 70, "calm": 71, "looking": 72, "distant": 73, "tennis": 74, "part": 75, "leather": 76, "dry": 77, "rectangular": 78, "grassy": 79, "light brown": 80, "yellow ": 81, "wearing": 82, "leafy": 83, "tiled": 84, "cement": 85, "light blue": 86, "cooked": 87, "pictured": 88, "curved": 89, "dead": 90, "eating": 91, "baseball": 92, "decorative": 93, "lit": 94, "paved": 95, "fluffy": 96, "framed": 97, "paper": 98, "watching": 99, "man's": 100, "colored": 101, "circular": 102, "plaid": 103, "dirt": 104, "stuffed": 105, "clean": 106, "dark brown": 107, "in the picture": 108, "back": 109, "stacked": 110, "steel": 111, "covered": 112, "full": 113, "skiing": 114, "present": 115, "flat": 116, "street": 117, "baby": 118, "dark blue": 119, "ceramic": 120, "three": 121, "beautiful": 122, "large ": 123, "black and white": 124, "blurry": 125, "golden": 126, "grazing": 127, "growing": 128, "wide": 129, "chocolate": 130, "chrome": 131, "sandy": 132, " white": 133, "White ": 134, "holding": 135, "bent": 136, "cut": 137, "small ": 138, "train": 139, "up": 140, "arched": 141, "snowy": 142, "metallic": 143, "spotted": 144, "pointy": 145, "running": 146, "leafless": 147, "furry": 148, "folded": 149, "electrical": 150}, "attribute_idx_to_name": ["white", "black", "green", "blue", "red", "brown", "yellow", "small", "large", "wooden", "gray", "silver", "metal", "orange", "grey", "tall", "long", "dark", "pink", "standing", "clear", "white ", "round", "tan", "here", "wood", "glass", "open", "purple", "big", "short", "plastic", "parked", "sitting", "walking", "black ", "striped", "young", "brick", "gold", "empty", "hanging", "old", "on", "blue ", "bright", "concrete", "cloudy", "green ", "colorful", "one", "beige", "bare", "wet", "closed", "square", "light", "stone", "little", "blonde", "shiny", "red ", "dirty", "thin", "smiling", "painted", "flying", "brown ", "thick", "sliced", "playing", "calm", "looking", "distant", "tennis", "part", "leather", "dry", "rectangular", "grassy", "light brown", "yellow ", "wearing", "leafy", "tiled", "cement", "light blue", "cooked", "pictured", "curved", "dead", "eating", "baseball", "decorative", "lit", "paved", "fluffy", "framed", "paper", "watching", "man's", "colored", "circular", "plaid", "dirt", "stuffed", "clean", "dark brown", "in the picture", "back", "stacked", "steel", "covered", "full", "skiing", "present", "flat", "street", "baby", "dark blue", "ceramic", "three", "beautiful", "large ", "black and white", "blurry", "golden", "grazing", "growing", "wide", "chocolate", "chrome", "sandy", " white", "White ", "holding", "bent", "cut", "small ", "train", "up", "arched", "snowy", "metallic", "spotted", "pointy", "running", "leafless", "furry", "folded", "electrical"], "pred_name_to_idx": {"__in_image__": 0, "wearing": 1, "on": 2, "has": 3, "parked on": 4, "in": 5, "near": 6, "with": 7, "along": 8, "in front of": 9, "sitting at": 10, "against": 11, "of": 12, "above": 13, "sitting on": 14, "at": 15, "looking at": 16, "under": 17, "across": 18, "walking on": 19, "lying on": 20, "between": 21, "carrying": 22, "riding": 23, "from": 24, "over": 25, "and": 26, "behind": 27, "attached to": 28, "walking in": 29, "holding": 30, "outside": 31, "crossing": 32, "hanging from": 33, "for": 34, "covered in": 35, "standing on": 36, "painted on": 37, "using": 38, "flying in": 39, "laying on": 40, "beneath": 41, "watching": 42, "covering": 43, "to": 44, "worn by": 45, "eating": 46, "says": 47, "flying": 48, "playing": 49}, "pred_idx_to_name": ["__in_image__", "wearing", "on", "has", "parked on", "in", "near", "with", "along", "in front of", "sitting at", "against", "of", "above", "sitting on", "at", "looking at", "under", "across", "walking on", "lying on", "between", "carrying", "riding", "from", "over", "and", "behind", "attached to", "walking in", "holding", "outside", "crossing", "hanging from", "for", "covered in", "standing on", "painted on", "using", "flying in", "laying on", "beneath", "watching", "covering", "to", "worn by", "eating", "says", "flying", "playing"]}