{"object_name_to_idx": {"__image__": 0, "airplane": 1, "animal": 2, "arm": 3, "bag": 4, "banana": 5, "basket": 6, "beach": 7, "bear": 8, "bed": 9, "bench": 10, "bike": 11, "bird": 12, "board": 13, "boat": 14, "book": 15, "boot": 16, "bottle": 17, "bowl": 18, "box": 19, "boy": 20, "branch": 21, "building": 22, "bus": 23, "cabinet": 24, "cap": 25, "car": 26, "cat": 27, "chair": 28, "child": 29, "clock": 30, "coat": 31, "counter": 32, "cow": 33, "cup": 34, "curtain": 35, "desk": 36, "dog": 37, "door": 38, "drawer": 39, "ear": 40, "elephant": 41, "engine": 42, "eye": 43, "face": 44, "fence": 45, "finger": 46, "flag": 47, "flower": 48, "food": 49, "fork": 50, "fruit": 51, "giraffe": 52, "girl": 53, "glass": 54, "glove": 55, "guy": 56, "hair": 57, "hand": 58, "handle": 59, "hat": 60, "head": 61, "helmet": 62, "hill": 63, "horse": 64, "house": 65, "jacket": 66, "jean": 67, "kid": 68, "kite": 69, "lady": 70, "lamp": 71, "laptop": 72, "leaf": 73, "leg": 74, "letter": 75, "light": 76, "logo": 77, "man": 78, "men": 79, "motorcycle": 80, "mountain": 81, "mouth": 82, "neck": 83, "nose": 84, "number": 85, "orange": 86, "pant": 87, "paper": 88, "paw": 89, "people": 90, "person": 91, "phone": 92, "pillow": 93, "pizza": 94, "plane": 95, "plant": 96, "plate": 97, "player": 98, "pole": 99, "post": 100, "pot": 101, "racket": 102, "railing": 103, "rock": 104, "roof": 105, "room": 106, "screen": 107, "seat": 108, "sheep": 109, "shelf": 110, "shirt": 111, "shoe": 112, "short": 113, "sidewalk": 114, "sign": 115, "sink": 116, "skateboard": 117, "ski": 118, "skier": 119, "sneaker": 120, "snow": 121, "sock": 122, "stand": 123, "street": 124, "surfboard": 125, "table": 126, "tail": 127, "tie": 128, "tile": 129, "tire": 130, "toilet": 131, "towel": 132, "tower": 133, "track": 134, "train": 135, "tree": 136, "truck": 137, "trunk": 138, "umbrella": 139, "vase": 140, "vegetable": 141, "vehicle": 142, "wave": 143, "wheel": 144, "window": 145, "windshield": 146, "wing": 147, "wire": 148, "woman": 149, "zebra": 150}, "object_idx_to_name": ["__image__", "airplane", "animal", "arm", "bag", "banana", "basket", "beach", "bear", "bed", "bench", "bike", "bird", "board", "boat", "book", "boot", "bottle", "bowl", "box", "boy", "branch", "building", "bus", "cabinet", "cap", "car", "cat", "chair", "child", "clock", "coat", "counter", "cow", "cup", "curtain", "desk", "dog", "door", "drawer", "ear", "elephant", "engine", "eye", "face", "fence", "finger", "flag", "flower", "food", "fork", "fruit", "giraffe", "girl", "glass", "glove", "guy", "hair", "hand", "handle", "hat", "head", "helmet", "hill", "horse", "house", "jacket", "jean", "kid", "kite", "lady", "lamp", "laptop", "leaf", "leg", "letter", "light", "logo", "man", "men", "motorcycle", "mountain", "mouth", "neck", "nose", "number", "orange", "pant", "paper", "paw", "people", "person", "phone", "pillow", "pizza", "plane", "plant", "plate", "player", "pole", "post", "pot", "racket", "railing", "rock", "roof", "room", "screen", "seat", "sheep", "shelf", "shirt", "shoe", "short", "sidewalk", "sign", "sink", "skateboard", "ski", "skier", "sneaker", "snow", "sock", "stand", "street", "surfboard", "table", "tail", "tie", "tile", "tire", "toilet", "towel", "tower", "track", "train", "tree", "truck", "trunk", "umbrella", "vase", "vegetable", "vehicle", "wave", "wheel", "window", "windshield", "wing", "wire", "woman", "zebra"], "attribute_name_to_idx": {"white": 0, "black": 1, "blue": 2, "green": 3, "red": 4, "brown": 5, "yellow": 6, "small": 7, "large": 8, "wooden": 9, "silver": 10, "orange": 11, "grey": 12, "tall": 13, "long": 14, "dark": 15, "pink": 16, "standing": 17, "round": 18, "tan": 19, "glass": 20, "here": 21, "wood": 22, "open": 23, "purple": 24, "short": 25, "plastic": 26, "parked": 27, "sitting": 28, "walking": 29, "striped": 30, "brick": 31, "young": 32, "gold": 33, "old": 34, "hanging": 35, "empty": 36, "on": 37, "bright": 38, "cloudy": 39, "colorful": 40, "one": 41, "beige": 42, "bare": 43, "wet": 44, "light": 45, "square": 46, "closed": 47, "stone": 48, "shiny": 49, "thin": 50, "dirty": 51, "flying": 52, "smiling": 53, "painted": 54, "thick": 55, "part": 56, "sliced": 57, "playing": 58, "calm": 59, "leather": 60, "distant": 61, "rectangular": 62, "dry": 63, "cement": 64, "leafy": 65, "tiled": 66, "man's": 67, "baseball": 68, "cooked": 69, "pictured": 70, "curved": 71, "decorative": 72, "dead": 73, "eating": 74, "paper": 75, "paved": 76, "fluffy": 77, "lit": 78, "framed": 79, "dirt": 80, "watching": 81, "colored": 82, "stuffed": 83, "clean": 84, "in the picture": 85, "steel": 86, "stacked": 87, "covered": 88, "full": 89, "three": 90, "street": 91, "flat": 92, "baby": 93, "black and white": 94, "beautiful": 95, "present": 96, "grazing": 97, "sandy": 98, "golden": 99, "blurry": 100, "chocolate": 101, "cut": 102, "bent": 103, "train": 104, "up": 105, "arched": 106, "metallic": 107, "spotted": 108, "electrical": 109, "pointy": 110, "running": 111, "in background": 112, "rusty": 113, "traffic": 114, "behind": 115, "high": 116, "off": 117, "leaning": 118, "moving": 119, "multicolored": 120, "woman's": 121, "pair": 122, "huge": 123, "background": 124, "chain link": 125, "checkered": 126, "top": 127, "broken": 128, "worn": 129, "patterned": 130, "overcast": 131, "waiting": 132, "rubber": 133, "riding": 134, "porcelain": 135, "adult": 136, "cloudless": 137, "curly": 138, "cardboard": 139, "pointed": 140, "cream": 141, "four": 142, "computer": 143, "many": 144, "bald": 145, "snow covered": 146, "reflective": 147, "rear": 148, "american": 149}, "attribute_idx_to_name": ["white", "black", "blue", "green", "red", "brown", "yellow", "small", "large", "wooden", "silver", "orange", "grey", "tall", "long", "dark", "pink", "standing", "round", "tan", "glass", "here", "wood", "open", "purple", "short", "plastic", "parked", "sitting", "walking", "striped", "brick", "young", "gold", "old", "hanging", "empty", "on", "bright", "cloudy", "colorful", "one", "beige", "bare", "wet", "light", "square", "closed", "stone", "shiny", "thin", "dirty", "flying", "smiling", "painted", "thick", "part", "sliced", "playing", "calm", "leather", "distant", "rectangular", "dry", "cement", "leafy", "tiled", "man's", "baseball", "cooked", "pictured", "curved", "decorative", "dead", "eating", "paper", "paved", "fluffy", "lit", "framed", "dirt", "watching", "colored", "stuffed", "clean", "in the picture", "steel", "stacked", "covered", "full", "three", "street", "flat", "baby", "black and white", "beautiful", "present", "grazing", "sandy", "golden", "blurry", "chocolate", "cut", "bent", "train", "up", "arched", "metallic", "spotted", "electrical", "pointy", "running", "in background", "rusty", "traffic", "behind", "high", "off", "leaning", "moving", "multicolored", "woman's", "pair", "huge", "background", "chain link", "checkered", "top", "broken", "worn", "patterned", "overcast", "waiting", "rubber", "riding", "porcelain", "adult", "cloudless", "curly", "cardboard", "pointed", "cream", "four", "computer", "many", "bald", "snow covered", "reflective", "rear", "american"], "pred_name_to_idx": {"__in_image__": 0, "above": 1, "across": 2, "against": 3, "along": 4, "and": 5, "at": 6, "attached to": 7, "behind": 8, "belonging to": 9, "between": 10, "carrying": 11, "covered in": 12, "covering": 13, "eating": 14, "flying in": 15, "for": 16, "from": 17, "growing on": 18, "hanging from": 19, "has": 20, "holding": 21, "in": 22, "in front of": 23, "laying on": 24, "looking at": 25, "lying on": 26, "made of": 27, "mounted on": 28, "near": 29, "of": 30, "on": 31, "on back of": 32, "over": 33, "painted on": 34, "parked on": 35, "part of": 36, "playing": 37, "riding": 38, "says": 39, "sitting on": 40, "standing on": 41, "to": 42, "under": 43, "using": 44, "walking in": 45, "walking on": 46, "watching": 47, "wearing": 48, "wears": 49, "with": 50}, "pred_idx_to_name": ["__in_image__", "above", "across", "against", "along", "and", "at", "attached to", "behind", "belonging to", "between", "carrying", "covered in", "covering", "eating", "flying in", "for", "from", "growing on", "hanging from", "has", "holding", "in", "in front of", "laying on", "looking at", "lying on", "made of", "mounted on", "near", "of", "on", "on back of", "over", "painted on", "parked on", "part of", "playing", "riding", "says", "sitting on", "standing on", "to", "under", "using", "walking in", "walking on", "watching", "wearing", "wears", "with"]}